Repository: malbert-infoport/AI4Devs
Catalog: InfoportOneAdmon.Back/InfoportOneAdmon.Back.Api/Resources/SharedResource.*.resx
Languages: es_es

# COURSE_DELETE_HAS_WORKER
source: The course cannot be removed because it has associated workers.
es_es: No se puede eliminar el curso porque tiene trabajadores asociados.

# HELIX6VALIDATION_CAPITALLETTER
source: The first letter of the field {0} must be capitalized.
es_es: La primera letra del campo {0} debe ser mayúscula.

# HELIXVALIDATION_COMPARE
source: {0}' and '{1}' do not match.
es_es: {0}' y'{1}' no coinciden.

# HELIXVALIDATION_CREDITCARD
source: The {0} field is not a valid credit card number.
es_es: El campo {0} no es un número válido de tarjeta de crédito.

# HELIXVALIDATION_EMAILADDRESS
source: The {0} field is not a valid e-mail address.
es_es: El campo {0} no es una dirección de correo electrónico válida.

# HELIXVALIDATION_ENUMDATATYPE
source: The {1} field value '{0}' must be part of {2} enumeration.
es_es: El valor '{0}' del campo {1} debe formar parte del enumerado {2}.

# HELIXVALIDATION_FILEEXTENSIONS
source: The {0} field only accepts files with the following extensions: {1}
es_es: El campo {0} solo acepta archivos con las siguientes extensiones: {1}

# HELIXVALIDATION_MAXLENGTH
source: The field {0} must be a string or array type with a maximum length of '{1}'.
es_es: El campo {0} debe ser una cadena de texto o un array con una longitud máxima de '{1}'.

# HELIXVALIDATION_MINLENGTH
source: The field {0} must be a string or array type with a minimum length of '{1}'.
es_es: El campo {0} debe ser una cadena de texto o un array con una longitud mínima de '{1}'.

# HELIXVALIDATION_PHONE
source: The {0} field is not a valid phone number.
es_es: El campo {0} no es un número de teléfono válido.

# HELIXVALIDATION_RANGE
source: The field {0} must be between {1} and {2}.
es_es: El campo {0} debe estar entre {1} y {2}.

# HELIXVALIDATION_REGEX
source: The field {0} must match the regular expression '{1}'.
es_es: El campo {0} debe coincidir con la expresión regular '{1}'.

# HELIXVALIDATION_REQUIRED
source: The field {0} is required.
es_es: El campo {0} es requerido.

# HELIXVALIDATION_STRINGLENGTH
source: The field {0} must be a string with a minimum length of {2} and a maximum length of {1}.
es_es: El campo {0} debe ser una cadena de texto con una longitud mínima de {2} y una longitud máxima de {1}.

# HELIXVALIDATION_URL
source: The {0} field is not a valid fully-qualified http, https, or ftp URL.
es_es: El campo {0} no es una URL http, https o ftp totalmente calificada y válida.

# MESSAGE_UK_WORKER
source: A worker can't be repeated by name and surnames.
es_es: No se puede repetir un trabajador por nombre y apellidos.

# PROJECT_DELETE_HAS_WORKER
source: The project cannot be removed because it has associated workers.
es_es: No se puede eliminar el proyecto porque tiene trabajadores asociados.

# TRAINEE_WORKER_MUST_BE_FROM_AGENCY
source: The trainee worker {0} {1} must come from agency.
es_es: El trabajador en prácticas {0} {1} debe de ser un trabajador de agencia.

# UPDATE_DELETE_LOGIC
source: It cannot be modified because it has been logic deleted.
es_es: No se puede modificar porque está dado de baja.

# VALIDITY_CANT_INSERT_BETWEEN
source: You cannot insert a validity entity with a start date before the current validity
es_es: No se puede insertar una vigencia con fecha de inicio anterior a la vigencia actual

# VALIDITY_DELETE_LOGIC
source: The entity with validity {0} cannot be logic deleted. You can only set the end of validity date or delete it completely.
es_es: La entidad con vigencia {0} no se puede dar de baja. Únicamente se puede indicar la fecha de fin de vigencia o borrarla completamente.

# VALIDITY_OVERLAPPED
source: Exists a dates overlap with the entity key {0} of the validity entity {1}.
es_es: Existe un solape de fechas para la clave {0} de la entidad con vigencia {1}.

# VALIDITY_TO_BEFORE_FROM
source: Validity date to must be greater than date to.
es_es: La fecha de fin de vigencia debe ser mayor que la fecha de inicio.

# VERSION_EXISTS
source: The entity key {0} and version number {1} of the entity {2} already exists.
es_es: La clave {0} y número de versión {1} de la entidad versionada {2} ya existe.

# VERSION_KEY_NOT_EXISTS
source: The entity key {0} of the entity {1} no exists.
es_es: La clave {0} de la entidad versionada {1} no existe.
